Revit 2027 API
ViewDisplayBackground.HorizontalImageScale Property
 The horizontal scale of the background image; the scale of 1.0 puts the image pixel-to-pixel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HorizontalImageScale { get; }
Public ReadOnly Property HorizontalImageScale As Double
	Get
public:
property double HorizontalImageScale {
	double get ();
}
member HorizontalImageScale : float with get
Property Value
Double
See Also
Reference
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace